Repository: giellalt/corpus-nob
Catalog: prestable/tmx/smj/facta/other_files/rammeplan_for_barnehagen.pdf.tmx
Source language: nob
Languages: smj

source: • blir kjent med ulike tradisjoner, levesett og familieformer
smj: • oahpásmuvvat duojna dájna dábijn, viessomvuogijn ja fámilljavuogij

source: • blir kjent med at samene er Norges urfolk, og får kjennskap til samisk
smj: • oahpásmuvvat sámijda Vuona álggoálmmugin, ja oahpásmuvvat sáme

source: kultur
smj: kultuvrraj

source: • får kjennskap til nasjonale minoriteter.
smj: • oahpásmuvvat nasjonála binneplågojda

source: • sørge for at barna erfarer at deres valg og handlinger kan påvirke
smj: • bærrájgåhtset vaj máná åtsådalli sijá válljim ja dåjma máhtti vájkkudit

source: situasjonen både for dem selv og for andre
smj: dilev sidjij allasisá ja iehtjádijda

source: • introdusere barna for personer, steder og samfunnsinstitusjoner i nærmiljøet for å skape tilhørighet og hjelpe barna med å orientere seg og ferdes trygt
smj: • introduserit mánájt ulmutjijda, bájkijda ja sebrudakinstitusjåvnåjda lahkabirrasin mij nanni gulluvasjvuodav ja viehkedit mánájt oahpásmuvátjit ja jasska liehket

source: • gi barna like muligheter, fremme likestilling og motvirke diskriminering,
smj: • vaddet mánájda sæmmi máhttelisvuodajt, åvdedit dássádusáv ja duostodit

source: fordommer, stereotypier og rasisme
smj: badjelgæhttjamav, guottojt, stereotypiajt ja rasismav

source: • gi barna forståelse av at samfunnet er i endring, og at de inngår i en
smj: • vaddet mánájda dádjadusáv sebrudahka le rievddamin, ja sij oassen

source: historisk, nåtidig og fremtidig sammenheng
smj: histåvrålasj, dálásj ja boahtteájggásasj aktijvuohtaj

source: • gjøre barna kjent med samisk kultur og levesett og knytte det samiske
smj: • oahpásmuhttet mánájt sáme kultuvrraj ja viessomvuogijda ja tjadnat sáme

source: perspektivet til merkedager og hverdagsliv, kunst og kultur og mattradisjoner
smj: perspektijvav mærkkabiejvijda ja árggabiejveiellemij, dájddaj ja kultuvrraj ja biebbmodábijda

source: • gi barna begynnende kjennskap til betydningen av menneskerettighetene,
smj: • vaddet mánájda álggodiedojt almasjrievtesvuoda sisadnuj, ållagasj
